MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS001/mcu.h
extern volatile LEBCON4BITS LEBCON4bits __attribute__((__sfr__));

#define AUXCON4 AUXCON4
extern volatile uint16_t AUXCON4 __attribute__((__sfr__));
typedef struct tagAUXCON4BITS {
  uint16_t CHOPLEN:1;
  uint16_t CHOPHEN:1;
  uint16_t CHOPSEL:4;
  uint16_t :8;
  uint16_t HRDDIS:1;
  uint16_t HRPDIS:1;
} AUXCON4BITS;
extern volatile AUXCON4BITS AUXCON4bits __attribute__((__sfr__));

#define CMPCON1 CMPCON1
extern volatile uint16_t CMPCON1 __attribute__((__sfr__));
typedef struct tagCMPCON1BITS {
  uint16_t RANGE:1;
  uint16_t CMPPOL:1;
  uint16_t HGAIN:1;
  uint16_t CMPSTAT:1;
  uint16_t HYSPOL:1;
  uint16_t EXTREF:1;
  uint16_t INSEL:2;
  uint16_t DACOE:1;
  uint16_t FCLKSEL:1;
  uint16_t FLTREN:1;
  uint16_t HYSSEL:2;
  uint16_t CMPSIDL:1;
  uint16_t :1;
  uint16_t CMPON:1;
} CMPCON1BITS;
extern volatile CMPCON1BITS CMPCON1bits __attribute__((__sfr__));

#define CMPDAC1 CMPDAC1
extern volatile uint16_t CMPDAC1 __attribute__((__sfr__));
typedef struct tagCMPDAC1BITS {
  uint16_t CMREF:10;
} CMPDAC1BITS;
extern volatile CMPDAC1BITS CMPDAC1bits __attribute__((__sfr__));

#define CMPCON2 CMPCON2
extern volatile uint16_t CMPCON2 __attribute__((__sfr__));
typedef struct tagCMPCON2BITS {
  uint16_t RANGE:1;
  uint16_t CMPPOL:1;
  uint16_t HGAIN:1;
  uint16_t CMPSTAT:1;
  uint16_t HYSPOL:1;
  uint16_t EXTREF:1;
  uint16_t INSEL:2;
  uint16_t DACOE:1;
  uint16_t FCLKSEL:1;
  uint16_t FLTREN:1;
  uint16_t HYSSEL:2;
  uint16_t CMPSIDL:1;
  uint16_t :1;
  uint16_t CMPON:1;
} CMPCON2BITS;
extern volatile CMPCON2BITS CMPCON2bits __attribute__((__sfr__));

#define CMPDAC2 CMPDAC2
extern volatile uint16_t CMPDAC2 __attribute__((__sfr__));
typedef struct tagCMPDAC2BITS {
  uint16_t CMREF:10;
} CMPDAC2BITS;
extern volatile CMPDAC2BITS CMPDAC2bits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile uint16_t RPINR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR0BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t INT1R:6;
    };
    struct {
      uint16_t :8;
      uint16_t INT1R0:1;
      uint16_t INT1R1:1;
      uint16_t INT1R2:1;
      uint16_t INT1R3:1;
      uint16_t INT1R4:1;
      uint16_t INT1R5:1;
    };
  };
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile uint16_t RPINR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR1BITS {
  union {
    struct {
      uint16_t INT2R:6;
    };
    struct {
      uint16_t INT2R0:1;
      uint16_t INT2R1:1;
      uint16_t INT2R2:1;
      uint16_t INT2R3:1;
      uint16_t INT2R4:1;
      uint16_t INT2R5:1;
    };
  };
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile uint16_t RPINR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR2BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t T1CKR:6;
    };
    struct {
      uint16_t :8;
      uint16_t T1CKR0:1;
      uint16_t T1CKR1:1;
      uint16_t T1CKR2:1;
      uint16_t T1CKR3:1;
      uint16_t T1CKR4:1;
      uint16_t T1CKR5:1;
    };
  };
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile uint16_t RPINR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR3BITS {
  union {
    struct {
      uint16_t T2CKR:6;
    };
    struct {
      uint16_t T2CKR0:1;
      uint16_t T2CKR1:1;
      uint16_t T2CKR2:1;
      uint16_t T2CKR3:1;
      uint16_t T2CKR4:1;
      uint16_t T2CKR5:1;
    };
  };
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

#define RPINR29 RPINR29
extern volatile uint16_t RPINR29 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR29BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t FLT1R:6;
    };
    struct {
      uint16_t :8;
      uint16_t FLT1R0:1;
      uint16_t FLT1R1:1;
      uint16_t FLT1R2:1;
      uint16_t FLT1R3:1;
      uint16_t FLT1R4:1;
      uint16_t FLT1R5:1;
    };
  };
} RPINR29BITS;
extern volatile RPINR29BITS RPINR29bits __attribute__((__sfr__));

#define RPINR30 RPINR30
extern volatile uint16_t RPINR30 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR30BITS {
  union {
    struct {
      uint16_t FLT2R:6;
      uint16_t :2;
      uint16_t FLT3R:6;
    };
    struct {
      uint16_t FLT2R0:1;
      uint16_t FLT2R1:1;
      uint16_t FLT2R2:1;
      uint16_t FLT2R3:1;
      uint16_t FLT2R4:1;
      uint16_t FLT2R5:1;
      uint16_t :2;
      uint16_t FLT3R0:1;
      uint16_t FLT3R1:1;
      uint16_t FLT3R2:1;
      uint16_t FLT3R3:1;
      uint16_t FLT3R4:1;
      uint16_t FLT3R5:1;
    };
  };
} RPINR30BITS;
extern volatile RPINR30BITS RPINR30bits __attribute__((__sfr__));

#define RPINR31 RPINR31
extern volatile uint16_t RPINR31 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR31BITS {
  union {
    struct {
      uint16_t FLT4R:6;
      uint16_t :2;
      uint16_t FLT5R:6;
    };
    struct {
      uint16_t FLT4R0:1;
      uint16_t FLT4R1:1;
      uint16_t FLT4R2:1;
      uint16_t FLT4R3:1;
      uint16_t FLT4R4:1;
      uint16_t FLT4R5:1;
      uint16_t :2;
      uint16_t FLT5R0:1;
      uint16_t FLT5R1:1;
      uint16_t FLT5R2:1;
      uint16_t FLT5R3:1;
      uint16_t FLT5R4:1;
      uint16_t FLT5R5:1;
    };
  };
} RPINR31BITS;
extern volatile RPINR31BITS RPINR31bits __attribute__((__sfr__));

#define RPINR32 RPINR32
extern volatile uint16_t RPINR32 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR32BITS {
  union {
    struct {
      uint16_t FLT6R:6;
      uint16_t :2;
      uint16_t FLT7R:6;
    };
    struct {
      uint16_t FLT6R0:1;
      uint16_t FLT6R1:1;
      uint16_t FLT6R2:1;
      uint16_t FLT6R3:1;
      uint16_t FLT6R4:1;
      uint16_t FLT6R5:1;
      uint16_t :2;
      uint16_t FLT7R0:1;
      uint16_t FLT7R1:1;
      uint16_t FLT7R2:1;
      uint16_t FLT7R3:1;
      uint16_t FLT7R4:1;
      uint16_t FLT7R5:1;
    };
  };
} RPINR32BITS;
extern volatile RPINR32BITS RPINR32bits __attribute__((__sfr__));

#define RPINR33 RPINR33
extern volatile uint16_t RPINR33 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR33BITS {
  union {
    struct {
      uint16_t FLT8R:6;
      uint16_t :2;
      uint16_t SYNCI1R:6;
    };
    struct {
      uint16_t FLT8R0:1;
      uint16_t FLT8R1:1;
      uint16_t FLT8R2:1;
      uint16_t FLT8R3:1;
      uint16_t FLT8R4:1;
      uint16_t FLT8R5:1;
      uint16_t :2;
      uint16_t SYNCI1R0:1;
      uint16_t SYNCI1R1:1;
      uint16_t SYNCI1R2:1;
      uint16_t SYNCI1R3:1;
      uint16_t SYNCI1R4:1;
      uint16_t SYNCI1R5:1;
    };
  };
} RPINR33BITS;
extern volatile RPINR33BITS RPINR33bits __attribute__((__sfr__));

#define RPINR34 RPINR34
extern volatile uint16_t RPINR34 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR34BITS {
  union {
    struct {
      uint16_t SYNCI2R:6;
    };
    struct {
      uint16_t SYNCI2R0:1;
      uint16_t SYNCI2R1:1;
      uint16_t SYNCI2R2:1;
      uint16_t SYNCI2R3:1;
      uint16_t SYNCI2R4:1;
      uint16_t SYNCI2R5:1;
    };
  };
} RPINR34BITS;
extern volatile RPINR34BITS RPINR34bits __attribute__((__sfr__));

#define RPOR0 RPOR0
extern volatile uint16_t RPOR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR0BITS {
  union {
    struct {
      uint16_t RP0R:6;
      uint16_t :2;
      uint16_t RP1R:6;
    };
    struct {
      uint16_t RP0R0:1;
      uint16_t RP0R1:1;
      uint16_t RP0R2:1;
      uint16_t RP0R3:1;
      uint16_t RP0R4:1;
      uint16_t RP0R5:1;
      uint16_t :2;
      uint16_t RP1R0:1;
      uint16_t RP1R1:1;
      uint16_t RP1R2:1;
      uint16_t RP1R3:1;
      uint16_t RP1R4:1;
      uint16_t RP1R5:1;
    };
  };
} RPOR0BITS;
extern volatile RPOR0BITS RPOR0bits __attribute__((__sfr__));

#define RPOR1 RPOR1
extern volatile uint16_t RPOR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR1BITS {
  union {
    struct {
      uint16_t RP2R:6;
      uint16_t :2;
      uint16_t RP3R:6;
    };
    struct {
      uint16_t RP2R0:1;
      uint16_t RP2R1:1;
      uint16_t RP2R2:1;
      uint16_t RP2R3:1;
      uint16_t RP2R4:1;
      uint16_t RP2R5:1;
      uint16_t :2;
      uint16_t RP3R0:1;
      uint16_t RP3R1:1;
      uint16_t RP3R2:1;
      uint16_t RP3R3:1;
      uint16_t RP3R4:1;
      uint16_t RP3R5:1;
    };
  };
} RPOR1BITS;
extern volatile RPOR1BITS RPOR1bits __attribute__((__sfr__));

#define RPOR2 RPOR2
extern volatile uint16_t RPOR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR2BITS {
  union {
    struct {
      uint16_t RP4R:6;
      uint16_t :2;
      uint16_t RP5R:6;
    };
    struct {
      uint16_t RP4R0:1;
      uint16_t RP4R1:1;
      uint16_t RP4R2:1;
      uint16_t RP4R3:1;
      uint16_t RP4R4:1;
      uint16_t RP4R5:1;
      uint16_t :2;
      uint16_t RP5R0:1;
      uint16_t RP5R1:1;
      uint16_t RP5R2:1;
      uint16_t RP5R3:1;
      uint16_t RP5R4:1;
      uint16_t RP5R5:1;
    };
  };
} RPOR2BITS;
