MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS001/mcu.h
#define _LEBCON4_LEB6_POSITION                   0x00000009
#define _LEBCON4_LEB6_MASK                       0x00000200
#define _LEBCON4_LEB6_LENGTH                     0x00000001

#define _AUXCON4_CHOPLEN_POSITION                0x00000000
#define _AUXCON4_CHOPLEN_MASK                    0x00000001
#define _AUXCON4_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON4_CHOPHEN_POSITION                0x00000001
#define _AUXCON4_CHOPHEN_MASK                    0x00000002
#define _AUXCON4_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON4_CHOPSEL_POSITION                0x00000002
#define _AUXCON4_CHOPSEL_MASK                    0x0000003C
#define _AUXCON4_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON4_HRDDIS_POSITION                 0x0000000E
#define _AUXCON4_HRDDIS_MASK                     0x00004000
#define _AUXCON4_HRDDIS_LENGTH                   0x00000001

#define _AUXCON4_HRPDIS_POSITION                 0x0000000F
#define _AUXCON4_HRPDIS_MASK                     0x00008000
#define _AUXCON4_HRPDIS_LENGTH                   0x00000001

#define _CMPCON1_RANGE_POSITION                  0x00000000
#define _CMPCON1_RANGE_MASK                      0x00000001
#define _CMPCON1_RANGE_LENGTH                    0x00000001

#define _CMPCON1_CMPPOL_POSITION                 0x00000001
#define _CMPCON1_CMPPOL_MASK                     0x00000002
#define _CMPCON1_CMPPOL_LENGTH                   0x00000001

#define _CMPCON1_HGAIN_POSITION                  0x00000002
#define _CMPCON1_HGAIN_MASK                      0x00000004
#define _CMPCON1_HGAIN_LENGTH                    0x00000001

#define _CMPCON1_CMPSTAT_POSITION                0x00000003
#define _CMPCON1_CMPSTAT_MASK                    0x00000008
#define _CMPCON1_CMPSTAT_LENGTH                  0x00000001

#define _CMPCON1_HYSPOL_POSITION                 0x00000004
#define _CMPCON1_HYSPOL_MASK                     0x00000010
#define _CMPCON1_HYSPOL_LENGTH                   0x00000001

#define _CMPCON1_EXTREF_POSITION                 0x00000005
#define _CMPCON1_EXTREF_MASK                     0x00000020
#define _CMPCON1_EXTREF_LENGTH                   0x00000001

#define _CMPCON1_INSEL_POSITION                  0x00000006
#define _CMPCON1_INSEL_MASK                      0x000000C0
#define _CMPCON1_INSEL_LENGTH                    0x00000002

#define _CMPCON1_DACOE_POSITION                  0x00000008
#define _CMPCON1_DACOE_MASK                      0x00000100
#define _CMPCON1_DACOE_LENGTH                    0x00000001

#define _CMPCON1_FCLKSEL_POSITION                0x00000009
#define _CMPCON1_FCLKSEL_MASK                    0x00000200
#define _CMPCON1_FCLKSEL_LENGTH                  0x00000001

#define _CMPCON1_FLTREN_POSITION                 0x0000000A
#define _CMPCON1_FLTREN_MASK                     0x00000400
#define _CMPCON1_FLTREN_LENGTH                   0x00000001

#define _CMPCON1_HYSSEL_POSITION                 0x0000000B
#define _CMPCON1_HYSSEL_MASK                     0x00001800
#define _CMPCON1_HYSSEL_LENGTH                   0x00000002

#define _CMPCON1_CMPSIDL_POSITION                0x0000000D
#define _CMPCON1_CMPSIDL_MASK                    0x00002000
#define _CMPCON1_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON1_CMPON_POSITION                  0x0000000F
#define _CMPCON1_CMPON_MASK                      0x00008000
#define _CMPCON1_CMPON_LENGTH                    0x00000001

#define _CMPDAC1_CMREF_POSITION                  0x00000000
#define _CMPDAC1_CMREF_MASK                      0x000003FF
#define _CMPDAC1_CMREF_LENGTH                    0x0000000A

#define _CMPCON2_RANGE_POSITION                  0x00000000
#define _CMPCON2_RANGE_MASK                      0x00000001
#define _CMPCON2_RANGE_LENGTH                    0x00000001

#define _CMPCON2_CMPPOL_POSITION                 0x00000001
#define _CMPCON2_CMPPOL_MASK                     0x00000002
#define _CMPCON2_CMPPOL_LENGTH                   0x00000001

#define _CMPCON2_HGAIN_POSITION                  0x00000002
#define _CMPCON2_HGAIN_MASK                      0x00000004
#define _CMPCON2_HGAIN_LENGTH                    0x00000001

#define _CMPCON2_CMPSTAT_POSITION                0x00000003
#define _CMPCON2_CMPSTAT_MASK                    0x00000008
#define _CMPCON2_CMPSTAT_LENGTH                  0x00000001

#define _CMPCON2_HYSPOL_POSITION                 0x00000004
#define _CMPCON2_HYSPOL_MASK                     0x00000010
#define _CMPCON2_HYSPOL_LENGTH                   0x00000001

#define _CMPCON2_EXTREF_POSITION                 0x00000005
#define _CMPCON2_EXTREF_MASK                     0x00000020
#define _CMPCON2_EXTREF_LENGTH                   0x00000001

#define _CMPCON2_INSEL_POSITION                  0x00000006
#define _CMPCON2_INSEL_MASK                      0x000000C0
#define _CMPCON2_INSEL_LENGTH                    0x00000002

#define _CMPCON2_DACOE_POSITION                  0x00000008
#define _CMPCON2_DACOE_MASK                      0x00000100
#define _CMPCON2_DACOE_LENGTH                    0x00000001

#define _CMPCON2_FCLKSEL_POSITION                0x00000009
#define _CMPCON2_FCLKSEL_MASK                    0x00000200
#define _CMPCON2_FCLKSEL_LENGTH                  0x00000001

#define _CMPCON2_FLTREN_POSITION                 0x0000000A
#define _CMPCON2_FLTREN_MASK                     0x00000400
#define _CMPCON2_FLTREN_LENGTH                   0x00000001

#define _CMPCON2_HYSSEL_POSITION                 0x0000000B
#define _CMPCON2_HYSSEL_MASK                     0x00001800
#define _CMPCON2_HYSSEL_LENGTH                   0x00000002

#define _CMPCON2_CMPSIDL_POSITION                0x0000000D
#define _CMPCON2_CMPSIDL_MASK                    0x00002000
#define _CMPCON2_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON2_CMPON_POSITION                  0x0000000F
#define _CMPCON2_CMPON_MASK                      0x00008000
#define _CMPCON2_CMPON_LENGTH                    0x00000001

#define _CMPDAC2_CMREF_POSITION                  0x00000000
#define _CMPDAC2_CMREF_MASK                      0x000003FF
#define _CMPDAC2_CMREF_LENGTH                    0x0000000A

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00003F00
#define _RPINR0_INT1R_LENGTH                     0x00000006

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

