MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS001/mcu.h
extern __attribute__((space(prog))) __prog__ uint16_t _FGS;
#define _FGS(x) __attribute__((address(0xffa),deprecated_definition("consider migrating to #pragma config"),section("__FGS.sec"),space(prog))) __prog__ uint16_t _FGS = (x);

/*
** Only one invocation of FGS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FGS.
** Multiple options may be combined, as shown:
**
** _FGS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   General Segment Write-Protect bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect bit:
**     GCP_ON               General Segment Code protection Enabled
**     GCP_OFF              General Segment Code protect is Disabled
**
*/

#define GWRP_ON              0x0002
#define GWRP_OFF             0x0003

#define GCP_ON               0x0001
#define GCP_OFF              0x0003



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0xdf0

#define __FICD_BASE 0xff0
#define __FICD_LENGTH 0x2

#define __FWDT_BASE 0xff4
#define __FWDT_LENGTH 0x2

#define __FOSC_BASE 0xff6
#define __FOSC_LENGTH 0x2

#define __FOSCSEL_BASE 0xff8
#define __FOSCSEL_LENGTH 0x2

#define __FGS_BASE 0xffa
#define __FGS_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x100

#define __YDATA_BASE 0x880
#define __YDATA_LENGTH 0x880
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x100

#define __YDATA_BASE 0x880
#define __YDATA_LENGTH 0x880
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x100

#define __YDATA_BASE 0x880
#define __YDATA_LENGTH 0x880

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 3
#define _RPOUT_U1RTS 4
#define _RPOUT_SDO1 7
#define _RPOUT_SCK1 8
#define _RPOUT_SS1 9
#define _RPOUT_OC1 18
#define _RPOUT_SYNCO1 37
#define _RPOUT_REFCLKO 38
#define _RPOUT_ACMP1 39
#define _RPOUT_ACMP2 40
#define _RPOUT_PWM4H 44
#define _RPOUT_PWM4L 45

#endif
